app/Controllers/AntrianController.php

SELECT `antrian`.*, `pelayanan`.`nama_pelayanan`, `loket`.`nama_loket`
FROM `antrian`
JOIN `pelayanan` ON `pelayanan`.`id` = `antrian`.`id_pelayanan`
JOIN `loket` ON `loket`.`id` = `antrian`.`id_loket`
ORDER BY `waktu` DESC
---
    public function index()
    {
        $model = new AntrianModel();
        $data['antrian'] = $model->select('antrian.*, pelayanan.nama_pelayanan, loket.nama_loket')
            ->join('pelayanan', 'pelayanan.id = antrian.id_pelayanan')
            ->join('loket', 'loket.id = antrian.id_loket')
            ->orderBy('waktu', 'DESC')
            ->findAll();

SELECT `antrian`.*, `pelayanan`.`nama_pelayanan`, `loket`.`nama_loket`
FROM `antrian`
JOIN `pelayanan` ON `pelayanan`.`id` = `antrian`.`id_pelayanan`
JOIN `loket` ON `loket`.`id` = `antrian`.`id_loket`
WHERE `antrian`.`id` = '1'
---
    public function invoice($id)
    {
        $antrianModel = new \App\Models\AntrianModel();
        $data['antrian'] = $antrianModel
            ->select('antrian.*, pelayanan.nama_pelayanan, loket.nama_loket')
            ->join('pelayanan', 'pelayanan.id = antrian.id_pelayanan')
            ->join('loket', 'loket.id = antrian.id_loket')
            ->find($id);