app/Controllers/LoketController.php

SELECT *
FROM `loket`
---
    public function index()
    {
        $model = new LoketModel();
        $data['loket'] = $model->findAll();