app/Controllers/PelayananController.php

SELECT *
FROM `pelayanan`
---
    public function index()
    {
        $model = new PelayananModel();
        $data['pelayanan'] = $model->findAll();